Revit 2025 API
AdaptivePointType Enumeration
 An enumerated type containing possible types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AdaptivePointType
Public Enumeration AdaptivePointType
public enum class AdaptivePointType
type AdaptivePointType
Members
Member name | Value | Description
ReferencePoint | 0 |  Reference Point.
PlacementPoint | 1 |  Placement Point.
ShapeHandlePoint | 2 |  Shape Handle Point.
See Also
Reference
Autodesk.Revit.DB Namespace